https://www.datacamp.com/courses/cleaning-data-in-python
# 1. Data types

In [139]:
import pandas as pd
import re
import numpy as np

In [140]:
tips = pd.read_csv('datasets/tips.csv')
tips.head()

   total_bill   tip     sex smoker  day    time  size total_dollar
0       16.99  1.01  Female     No  Sun  Dinner     2      $16.99
1       10.34  1.66    Male     No  Sun  Dinner     3      $10.34
2       21.01  3.50    Male     No  Sun  Dinner     3      $21.01
3       23.68  3.31    Male     No  Sun  Dinner     2      $23.68
4       24.59  3.61  Female     No  Sun  Dinner     4      $24.59

In [141]:
tips.dtypes

total_bill      float64
tip             float64
sex              object
smoker           object
day              object
time             object
size              int64
total_dollar     object
dtype: object

## 1) Converting object to category: Series = Series.astype('category')
- can make the DataFrame smaller.

In [142]:
tips.sex = tips.sex.astype('category')

In [143]:
tips.dtypes

total_bill       float64
tip              float64
sex             category
smoker            object
day               object
time              object
size               int64
total_dollar      object
dtype: object

## 2) Converting numeric numbers to object: Series = Series.astype(str)

In [144]:
tips.size = tips.size.astype(str)

In [145]:
tips.dtypes

total_bill       float64
tip              float64
sex             category
smoker            object
day               object
time              object
size              object
total_dollar      object
dtype: object

## 3) Converting strings to numeric values
- errors='coerce': if we don't have this argument, then python will return an error, because it will not know how to turn the string, dash, into a numeric value.

In [146]:
tips.size = pd.to_numeric(tips.size, errors='coerce')

In [147]:
tips.dtypes

total_bill       float64
tip              float64
sex             category
smoker            object
day               object
time              object
size               int64
total_dollar      object
dtype: object

In [148]:
tips.head()

   total_bill   tip     sex smoker  day    time  size total_dollar
0       16.99  1.01  Female     No  Sun  Dinner  1952      $16.99
1       10.34  1.66    Male     No  Sun  Dinner  1952      $10.34
2       21.01  3.50    Male     No  Sun  Dinner  1952      $21.01
3       23.68  3.31    Male     No  Sun  Dinner  1952      $23.68
4       24.59  3.61  Female     No  Sun  Dinner  1952      $24.59

# 2. Using regular expressions to clean strings
- import re

In [149]:
# 1) \d*: represents any digit, followed by an asterisk to match it 0 or more times. 12345678901
# 2) \$\d*: $12345678901
# 3) \$\d*\.\d*: the period matches any 1 character. $12345678901.42
# 4) \$\d*\.\d{2}: {2} is to match exactly 2 digits. $12345678901.24
# 5) ^\$\d*\.\d{2}$: The caret will tell the pattern to start the pattern match at the beginning of the value. 
# The dollar sign will tell the pattern to match at the end of the value. $12345678901.999.

In [150]:
pattern = re.compile('\$\d*\.\d{2}')
result = pattern.match('$17.89')

In [151]:
result

In [152]:
bool(result)

True

### Practice 2

In [153]:
phone = re.compile('\d{3}-\d{3}-\d{4}')
result1 = phone.match('123-456-7890')
result1

In [154]:
bool(result1)

True

#### re.findall( ): to extract multiple numbers

In [155]:
re.findall('\d+', 'the recipe calls for 6 strawberries and 2 bananas')

['6', '2']

In [156]:
bool(re.match(pattern='\d{3}-\d{3}-\d{4}', string='123-456-7890'))

True

In [157]:
bool(re.match(pattern='\$\d*\.\d{2}', string='$123.45'))

True

#### [A-Z]: to match any capital letter, followed by \w* to match an arbitrary number of alphanumeric characters.

In [158]:
bool(re.match(pattern='[A-Z]\w*', string='Australi23a'))

True

# 3. Using functions to clean data

In [159]:
trial = pd.read_csv('datasets/trial.csv',index_col='Unnamed: 0')
trial

        treatment a  treatment b
Daniel           18           42
John             12           31
Jane             24           27

In [160]:
trial.dtypes

treatment a    int64
treatment b    int64
dtype: object

In [161]:
trial.apply(np.mean, axis=0)

treatment a    18.000000
treatment b    33.333333
dtype: float64

In [162]:
trial.apply(np.mean, axis=1)

Daniel    30.0
John      21.5
Jane      25.5
dtype: float64

In [163]:
job = pd.read_csv('datasets/dob_job_application_filings_subset.csv')
job.head(3)

,Job #,Doc #,Borough,House #,Street Name,Block,Lot,Bin #,Job Type,Job Status,...,Owner's Last Name,Owner's Business Name,Owner's House Number,Owner'sHouse Street Name,City,State,Zip,Owner'sPhone #,Job Description,DOBRunDate
0,121577873,2,MANHATTAN,386,PARK AVENUE SOUTH,857,38,1016890,A2,D,...,MIGLIORE,MACKLOWE MANAGEMENT,126,EAST 56TH STREET,NEW YORK,NY,10222,2125545837,GENERAL MECHANICAL & PLUMBING MODIFICATIONS AS...,04/26/2013 12:00:00 AM
1,520129502,1,STATEN ISLAND,107,KNOX PLACE,342,1,5161350,A3,A,...,BLUMENBERG,NA,107,KNOX PLACE,STATEN ISLAND,NY,10314,3477398892,BUILDERS PAVEMENT PLAN 143 LF. ...,04/26/2013 12:00:00 AM
2,121601560,1,MANHATTAN,63,WEST 131 STREET,1729,9,1053831,A2,Q,...,MARKOWITZ,635 RIVERSIDE DRIVE NY LLC,619,WEST 54TH STREET,NEW YORK,NY,10016,2127652555,GENERAL CONSTRUCTION TO INCLUDE NEW PARTITIONS...,04/26/2013 12:00:00 AM

In [164]:
job.columns

Index(['Job #', 'Doc #', 'Borough', 'House #', 'Street Name', 'Block', 'Lot',
       'Bin #', 'Job Type', 'Job Status', 'Job Status Descrp',
       'Latest Action Date', 'Building Type', 'Community - Board', 'Cluster',
       'Landmarked', 'Adult Estab', 'Loft Board', 'City Owned', 'Little e',
       'PC Filed', 'eFiling Filed', 'Plumbing', 'Mechanical', 'Boiler',
       'Fuel Burning', 'Fuel Storage', 'Standpipe', 'Sprinkler', 'Fire Alarm',
       'Equipment', 'Fire Suppression', 'Curb Cut', 'Other',
       'Other Description', 'Applicant's First Name', 'Applicant's Last Name',
       'Applicant Professional Title', 'Applicant License #',
       'Professional Cert', 'Pre- Filing Date', 'Paid', 'Fully Paid',
       'Assigned', 'Approved', 'Fully Permitted', 'Initial Cost',
       'Total Est. Fee', 'Fee Status', 'Existing Zoning Sqft',
       'Proposed Zoning Sqft', 'Horizontal Enlrgmt', 'Vertical Enlrgmt',
       'Enlargement SQ Footage', 'Street Frontage', 'ExistingNo. of Stories',
       'Proposed No. of Stories', 'Existing Height', 'Proposed Height',
       'Existing Dwelling Units', 'Proposed Dwelling Units',
       'Existing Occupancy', 'Proposed Occupancy', 'Site Fill', 'Zoning Dist1',
       'Zoning Dist2', 'Zoning Dist3', 'Special District 1',
       'Special District 2', 'Owner Type', 'Non-Profit', 'Owner's First Name',
       'Owner's Last Name', 'Owner's Business Name', 'Owner's House Number',
       'Owner'sHouse Street Name', 'City ', 'State', 'Zip', 'Owner'sPhone #',
       'Job Description', 'DOBRunDate'],
      dtype='object')

In [165]:
job['Initial Cost'].head()

0    $75000.00
1        $0.00
2    $30000.00
3     $1500.00
4    $19500.00
Name: Initial Cost, dtype: object

# Practice 3
## 1) Series.apply(f)

In [166]:
def f(x):
    if x == 'Female':
        return 0
    elif x == 'Male':
        return 1
    else:
        return np.nan
tips['recode'] = tips.sex.apply(f)

In [167]:
tips.head()

   total_bill   tip     sex smoker  day    time  size total_dollar recode
0       16.99  1.01  Female     No  Sun  Dinner  1952      $16.99       0
1       10.34  1.66    Male     No  Sun  Dinner  1952      $10.34       1
2       21.01  3.50    Male     No  Sun  Dinner  1952      $21.01       1
3       23.68  3.31    Male     No  Sun  Dinner  1952      $23.68       1
4       24.59  3.61  Female     No  Sun  Dinner  1952      $24.59       0

## 2) lambda

In [168]:
tips['total_dollar_replace'] = tips.total_dollar.apply(lambda x: x.replace('$', ''))
tips.head()

,total_bill,tip,sex,smoker,day,time,size,total_dollar,recode,total_dollar_replace
0,16.99,1.01,Female,No,Sun,Dinner,1952,$16.99,0,16.99
1,10.34,1.66,Male,No,Sun,Dinner,1952,$10.34,1,10.34
2,21.01,3.50,Male,No,Sun,Dinner,1952,$21.01,1,21.01
3,23.68,3.31,Male,No,Sun,Dinner,1952,$23.68,1,23.68
4,24.59,3.61,Female,No,Sun,Dinner,1952,$24.59,0,24.59

In [182]:
tips['cost'] = tips.total_dollar.apply(lambda x: re.findall('\d+\d', x)[0])
tips.head()

,total_bill,tip,sex,smoker,day,time,size,total_dollar,recode,total_dollar_replace,cost
0,16.99,1.01,Female,No,Sun,Dinner,1952,$16.99,0,16.99,16
1,10.34,1.66,Male,No,Sun,Dinner,1952,$10.34,1,10.34,10
2,21.01,3.50,Male,No,Sun,Dinner,1952,$21.01,1,21.01,21
3,23.68,3.31,Male,No,Sun,Dinner,1952,$23.68,1,23.68,23
4,24.59,3.61,Female,No,Sun,Dinner,1952,$24.59,0,24.59,24

# 4. Duplicate & missing data
- drop_duplicates( )
- df.dropna( )
- Series = Series.fillna('missing')
- df[['col1', 'col2']] = df[['col1', 'col2']].fillna(0)
## Fill missing values with a test statistic
- Series = Series.fillna(Series.mean( ) )

In [185]:
air = pd.read_csv('datasets/airquality.csv')
air.head()

   Ozone  Solar.R  Wind  Temp  Month  Day
0   41.0    190.0   7.4    67      5    1
1   36.0    118.0   8.0    72      5    2
2   12.0    149.0  12.6    74      5    3
3   18.0    313.0  11.5    62      5    4
4    NaN      NaN  14.3    56      5    5

In [191]:
air.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 153 entries, 0 to 152
Data columns (total 6 columns):
Ozone      153 non-null float64
Solar.R    146 non-null float64
Wind       153 non-null float64
Temp       153 non-null int64
Month      153 non-null int64
Day        153 non-null int64
dtypes: float64(3), int64(3)
memory usage: 7.2 KB

In [188]:
ozone_mean = air.Ozone.mean()
ozone_mean

42.12931034482759

In [190]:
air.Ozone = air.Ozone.fillna(ozone_mean)
air.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 153 entries, 0 to 152
Data columns (total 6 columns):
Ozone      153 non-null float64
Solar.R    146 non-null float64
Wind       153 non-null float64
Temp       153 non-null int64
Month      153 non-null int64
Day        153 non-null int64
dtypes: float64(3), int64(3)
memory usage: 7.2 KB

In [192]:
air.head()

      Ozone  Solar.R  Wind  Temp  Month  Day
0  41.00000    190.0   7.4    67      5    1
1  36.00000    118.0   8.0    72      5    2
2  12.00000    149.0  12.6    74      5    3
3  18.00000    313.0  11.5    62      5    4
4  42.12931      NaN  14.3    56      5    5

# 5. Testing with asserts

In [198]:
aapl = pd.read_csv('datasets/aapl.csv', index_col='date')
aapl.head(8)

         adj_close   close    high     low    open      volume
date
3/1/00       31.68  130.31  132.06  118.50  118.56  38478000.0
3/2/00       29.66  122.00  127.94  120.69  127.00  11136800.0
3/3/00       31.12     NaN  128.23  120.00  124.87  11565200.0
3/6/00       30.56  125.69     NaN     NaN  126.00         NaN
3/7/00       29.87  122.87  127.44  121.12     NaN   9767600.0
3/8/00       29.66  122.00     NaN     NaN  122.87   9690800.0
3/9/00       29.72     NaN  125.00     NaN  120.87   9884400.0
3/10/00      30.57  125.75  127.94  121.00  121.69   8900800.0

In [209]:
# error means there's NaN
assert aapl.close.notnull().all()

AssertionError:

In [206]:
aapl_0 = aapl.fillna(0)
aapl_0.head(8)

         adj_close   close    high     low    open      volume
date
3/1/00       31.68  130.31  132.06  118.50  118.56  38478000.0
3/2/00       29.66  122.00  127.94  120.69  127.00  11136800.0
3/3/00       31.12    0.00  128.23  120.00  124.87  11565200.0
3/6/00       30.56  125.69    0.00    0.00  126.00         0.0
3/7/00       29.87  122.87  127.44  121.12    0.00   9767600.0
3/8/00       29.66  122.00    0.00    0.00  122.87   9690800.0
3/9/00       29.72    0.00  125.00    0.00  120.87   9884400.0
3/10/00      30.57  125.75  127.94  121.00  121.69   8900800.0

In [210]:
# when the assert stmt doesn't return anything, it means we don't have missing values.
assert aapl_0.close.notnull().all()

# Practice 4

In [213]:
ebola = pd.read_csv('datasets/ebola.csv')
ebola.head()

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali
0,1/5/2015,289,2776.0,NaN,10030.0,NaN,NaN,NaN,NaN,NaN,1786.0,NaN,2977.0,NaN,NaN,NaN,NaN,NaN
1,1/4/2015,288,2775.0,NaN,9780.0,NaN,NaN,NaN,NaN,NaN,1781.0,NaN,2943.0,NaN,NaN,NaN,NaN,NaN
2,1/3/2015,287,2769.0,8166.0,9722.0,NaN,NaN,NaN,NaN,NaN,1767.0,3496.0,2915.0,NaN,NaN,NaN,NaN,NaN
3,1/2/2015,286,NaN,8157.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3496.0,NaN,NaN,NaN,NaN,NaN,NaN
4,12/31/2014,284,2730.0,8115.0,9633.0,NaN,NaN,NaN,NaN,NaN,1739.0,3471.0,2827.0,NaN,NaN,NaN,NaN,NaN

In [222]:
ebola_0 = ebola.fillna(2)
ebola_0.head()

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali
0,1/5/2015,289,2776.0,2.0,10030.0,2.0,2.0,2.0,2.0,2.0,1786.0,2.0,2977.0,2.0,2.0,2.0,2.0,2.0
1,1/4/2015,288,2775.0,2.0,9780.0,2.0,2.0,2.0,2.0,2.0,1781.0,2.0,2943.0,2.0,2.0,2.0,2.0,2.0
2,1/3/2015,287,2769.0,8166.0,9722.0,2.0,2.0,2.0,2.0,2.0,1767.0,3496.0,2915.0,2.0,2.0,2.0,2.0,2.0
3,1/2/2015,286,2.0,8157.0,2.0,2.0,2.0,2.0,2.0,2.0,2.0,3496.0,2.0,2.0,2.0,2.0,2.0,2.0
4,12/31/2014,284,2730.0,8115.0,9633.0,2.0,2.0,2.0,2.0,2.0,1739.0,3471.0,2827.0,2.0,2.0,2.0,2.0,2.0

In [223]:
assert ebola_0.notnull().all().all()